D:\python3.7.8\python.exe D:/test/爬虫/音乐搜索器/LeoTalk.py
D:\python3.7.8\lib\site-packages\urllib3\connectionpool.py:1020: InsecureRequestWarning: Unverified HTTPS request is being made to host 'www.leoshow.cn'. Adding certificate verification is strongly advised. See: https://urllib3.readthedocs.io/en/latest/advanced-usage.html#ssl-warnings
  InsecureRequestWarning,
{"data":[{"type":"kugou","link":"http://www.kugou.com/song/#hash=99FC8DB5C60027B65D0719B623DDFC02","songid":"99FC8DB5C60027B65D0719B623DDFC02","title":"这世代","author":"","lrc":"","url":"https://sharefs.yun.kugou.com/202103041327/4bf85d745f10dfde8bdbd78eb549cbcc/G054/M01/0C/03/FpQEAFaMSviAbOwLAEEt4hXIeuA703.mp3","pic":"http://m.kugou.com/static/images/share2014/default_singer.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=1F63BE431B47D9C863AC1014DC171D1C","songid":"1F63BE431B47D9C863AC1014DC171D1C","title":"这世代","author":"柳丁的赞美诗","lrc":"﻿[id:$00000000]
[ar:柳丁的赞美诗]
[ti:这世代]
[by:]
[hash:1f63be431b47d9c863ac1014dc171d1c]
[al:]
[sign:]
[qq:]
[total:175501]
[offset:0]
[00:00.60]柳丁的赞美诗 - 这世代
[00:19.30]看哪犹大狮子已得胜
[00:23.04]众圣徒预备朝见祂
[00:26.83]少年人看异象
[00:28.75]老年人要作异梦
[00:30.78]因为神的复兴将来到
[00:36.26]听到锡安的号角响起
[00:40.02]万国万民都要颤抖
[00:44.02]耶和华日子将到
[00:45.89]光明将除去黑暗
[00:48.07]因为神的复兴将来到
[00:51.61]我们要看到神的荣耀
[00:57.48]这世代我们用敬拜争战
[01:01.28]我们用祷告改变世界
[01:05.12]这世代圣灵
[01:06.59]要更新浇灌我们
[01:09.18]这世代是耶稣世代
[01:20.26]听到锡安的号角响起
[01:24.22]万国万民都要颤抖
[01:28.01]耶和华日子将到
[01:29.99]光明将除去黑暗
[01:32.17]因为神的复兴将来到
[01:35.71]我们要看到神的荣耀
[01:41.74]这世代我们用敬拜争战
[01:45.35]我们用祷告改变世界
[01:49.20]这世代圣灵
[01:50.78]要更新浇灌我们
[01:53.26]这世代是耶稣世代
[01:56.96]这世代我们用敬拜争战
[02:00.90]我们用改变世界
[02:04.85]这世代圣灵
[02:06.37]要更新浇灌我们
[02:08.64]这世代是耶稣世代
[02:20.39]因为神的复兴将来到
[02:24.01]我们要看到神的荣耀
[02:28.51]因为神的复兴将来到
[02:31.95]我们要看到神的荣耀
[02:35.86]因为神的复兴将来到
[02:40.82]我们要看到神的荣耀
","url":"https://sharefs.yun.kugou.com/202103041327/f206a1a14e82319404f8cd17ce725343/G089/M07/1F/07/OZQEAFihO7aABqvZACrZ988CvMM254.mp3","pic":"http://imge.kugou.com/stdmusic/150/20170213/20170213130010931057.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=B176D283B56D6B2A7B106244B51A14A7","songid":"B176D283B56D6B2A7B106244B51A14A7","title":"这世代","author":"华语群星","lrc":"","url":"https://sharefs.yun.kugou.com/202103041327/5c63366f3e2807f1e4b47d07385d38bb/G073/M04/09/18/iQ0DAFfYfiSAeHm_AEEt4qCrqU4073.mp3","pic":"http://singerimg.kugou.com/uploadpic/softhead/150/20200604/20200604210502592485.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=1776C64D23ACFF97BC252B65805899EC","songid":"1776C64D23ACFF97BC252B65805899EC","title":"这世代","author":"","lrc":"[id:$00000000]
[ar:李妍]
[ti:这世代]
[by:shixiang_karakal]
[00:00.00]这世代 - 李妍
[00:01.29]词：T-Rexx
[00:01.65]曲：李妍
[00:02.23]编曲：Tomy Ho/Logout Fan
[00:03.12]监制：Tomy Ho/Logout Fan/麦镟璧
[00:11.69]写教条式的训话
[00:14.92]怎可了解我想法
[00:18.39]今天我怎去抑压
[00:21.59]你在意过吗
[00:24.88]这世代怎么抉择
[00:28.04]于低处怎去挣扎
[00:31.49]不选你的对等于
[00:34.67]我就错了吗
[01:04.07]规则里避着差错
[01:06.97]天天沉闷地工作
[01:10.21]夜夜无谓地挥霍
[01:13.38]最美好的却未碰过
[01:16.72]总想过淡泊的过
[01:20.04]但亦能热烈的过
[01:23.27]听听最内在最想渴望怎么过
[01:29.58]从追赶积分开始想都不去想
[01:32.78]开始不懂笑 开始只倍觉慌张
[01:35.96]通通关起了声响
[01:37.53]事事要退让自量
[01:39.26]但是并未去看明日哪样
[01:42.18]就望望旧日 未实践的话
[01:45.67]就尽力实现 实验那真假
[01:48.88]志向太近 光阴很远
[01:51.80]未来有我 划过定界
[01:55.51]将教条一一拆下
[01:58.40]跨出了一套方格
[02:01.65]跨出我一套风格
[02:04.87]去踏过困厄
[02:07.88]这世代总可抉择
[02:11.22]于低处总会挣扎
[02:14.66]不选你的对等于
[02:17.67]我就错了吗
[02:34.22]总想过自订方向
[02:37.54]被人拦下便心痒
[02:40.60]今天看自立的我
[02:43.57]你却狠批别乱妄想
[02:47.07]当天你是旧的我
[02:49.90]这想法你亦想过
[02:53.34]请知道代代有种渴望
[02:59.97]何解于当天开始想都不去想
[03:02.95]开始不懂笑 开始只倍觉慌张
[03:05.99]通通关起了声响
[03:07.79]事事要退让自量
[03:09.35]但是并未去看明日哪样
[03:12.59]命运并未定局 任我选择
[03:15.76]别认为事事亦 受你检测
[03:18.92]志向太近 光阴很远
[03:21.84]未来有我 突破定格
[03:38.52]你是你 我是我 经历可 一样么
[03:44.56]若然望陈旧桥段
[03:47.61]能明白我么
[03:51.27]你是你 我是我 经历可 一样么
[03:57.36]别随便拿着遗憾
[04:00.42]来奚落隔阻
[04:04.28]将教条一一拆下
[04:07.44]推开你一切方格
[04:10.61]主宰我一切风格
[04:13.72]你望见了吗
[04:16.86]这世代总可抉择
[04:20.30]于低处总会挣扎
[04:23.48]不需要给我惊讶
[04:26.67]我自有把握
","url":"https://sharefs.yun.kugou.com/202103041327/815a4c10cbd00fe98e1639991d282bdf/KGTX/CLTX001/1776c64d23acff97bc252b65805899ec.mp3","pic":"http://imge.kugou.com/stdmusic/150/20210119/20210119215708153877.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=14289A71420A4B0AD0B46819ED8965FE","songid":"14289A71420A4B0AD0B46819ED8965FE","title":"这世代要呼求你","author":"赞美之泉音乐事工","lrc":"[id:$00000000]
[ti:这世代要呼求祢]
[ar:赞美之泉音乐事工]
[00:00.18]这世代要呼求祢 - 赞美之泉音乐事工
[00:01.26]词：陈麒安/游智婷
[00:01.59]曲：陈麒安/游智婷
[00:27.01]主 我属于祢
[00:32.25]求祢差遣 我就跟随
[00:39.36]祢说话
[00:42.41]我就顺服
[00:46.04]勇敢爱祢所爱的
[00:57.05]我们属于祢
[01:02.35]求主开启 我们眼睛
[01:09.45]每世代向祢呼求
[01:16.06]祢教我如何争战
[01:25.98]让我们不分彼此
[01:32.69]众教会同心呼求
[01:42.79]这世代要呼求祢
[01:49.42]呼求祢的爱降临
[01:55.95]高举起代祷双手
[02:02.84]我们心与祢合一
[02:32.67]紧紧跟随 紧紧跟随
[02:39.34]紧紧跟随祢心意
[02:46.07]永不放弃 永不放弃
[02:52.68]直到祢的国降临
[02:59.48]紧紧跟随 紧紧跟随
[03:06.15]紧紧跟随祢心意
[03:12.77]永不放弃 永不放弃
[03:19.40]直到祢的国降临
[03:29.53]这世代要呼求祢
[03:36.00]呼求祢的爱降临
[03:42.74]高举起代祷双手
[03:49.34]我们心与祢合一
[03:56.18]这世代要呼求祢
[04:02.71]呼求祢的爱降临
[04:09.38]破口中勇敢站立
[04:16.07]祢旨意成就这地
[04:46.07]这世代要呼求祢
[04:52.68]呼求祢的爱降临
[04:59.52]高举起代祷双手
[05:06.04]我们心与祢合一
[05:12.83]这世代要呼求祢
[05:19.42]呼求祢的爱降临
[05:26.04]破口中勇敢站立
[05:32.76]祢旨意成就这地
[05:43.01]紧紧跟随 紧紧跟随
[05:49.38]紧紧跟随祢心意
[05:56.17]永不放弃 永不放弃
[06:02.71]直到祢的国降临
[06:09.41]紧紧跟随 紧紧跟随
[06:16.09]紧紧跟随祢心意
[06:22.78]永不放弃 永不放弃
[06:29.43]直到祢的国降临
","url":"https://sharefs.yun.kugou.com/202103041327/21136271808d01ff06e96c0e76ff458b/G071/M03/04/08/J5QEAFdxzR2Acz8oAGoPdkPHmsk926.mp3","pic":"http://singerimg.kugou.com/uploadpic/softhead/150/20150415/20150415095317440163.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=A4655CB868E4A1627FB1B78827127052","songid":"A4655CB868E4A1627FB1B78827127052","title":"唤醒 这个时代","author":"主内肢体","lrc":"﻿[id:$00000000]
[ar:网络歌手]
[ti:唤醒这个世代 - 美丽的家 ]
[by:]
[hash:c924d01ea440bb486690c43aeb0a4335]
[al:]
[sign:]
[qq:]
[total:184851]
[offset:0]
[00:00.15]网络歌手 - 唤醒这个世代 - 美丽的家
[00:03.28]作词：天之骄子
[00:04.54]作曲：天之骄子
[00:15.63]用我们全部的爱
[00:21.16]唤醒这个世代
[00:26.87]告诉心里绝望的人
[00:32.47]刚强的站立起来
[00:38.09]神已把我们赎买
[00:43.05]如此洪恩岂能在等待
[00:49.37]快快去抢救灵魂
[00:55.02]主愿人人都悔改
[01:12.02]用我们真诚的爱
[01:17.74]唤醒这个世代
[01:23.32]告诉心里空虚的人
[01:28.94]快把耶稣接起来
[01:34.56]主恩们已经敞开
[01:39.57]如此洪恩岂能在徘徊
[01:45.86]让我们一起来敬拜
[01:51.54]融入这赞美的人海
[01:57.26]神已把我们赎买
[02:02.07]如此洪恩岂能在等待
[02:08.45]快快去抢救灵魂
[02:14.16]主愿人人都悔改
[02:19.73]主恩们已经敞开
[02:24.70]如此洪恩岂能在徘徊
[02:30.96]让我们一起来敬拜
[02:36.63]融入这赞美的人海
[02:42.39]融入这赞美的人海
","url":"https://sharefs.yun.kugou.com/202103041327/ad7db3c6d12a5e0c1a0b5baf51996267/G215/M04/13/19/Fw4DAF7Sml-AA-ZTAC0ks78BWEA684.mp3","pic":""},{"type":"kugou","link":"http://www.kugou.com/song/#hash=7A0F52BD061535EAE843CA86D167EA06","songid":"7A0F52BD061535EAE843CA86D167EA06","title":"唤醒这个世代","author":"","lrc":"","url":"https://sharefs.yun.kugou.com/202103041327/17ba03d92178917e1a15a4f671c22dac/G187/M09/0E/15/m5QEAF5fZpOAB6cyACyD6-Ep8N8851.mp3","pic":"http://m.kugou.com/static/images/share2014/default_singer.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=7A0F52BD061535EAE843CA86D167EA06","songid":"7A0F52BD061535EAE843CA86D167EA06","title":"唤醒这个世代","author":"","lrc":"","url":"https://sharefs.yun.kugou.com/202103041327/17ba03d92178917e1a15a4f671c22dac/G187/M09/0E/15/m5QEAF5fZpOAB6cyACyD6-Ep8N8851.mp3","pic":"http://m.kugou.com/static/images/share2014/default_singer.jpg"},{"type":"kugou","link":"http://www.kugou.com/song/#hash=14289A71420A4B0AD0B46819ED8965FE","songid":"14289A71420A4B0AD0B46819ED8965FE","title":"这世代要呼求你","author":"赞美之泉音乐事工","lrc":"[id:$00000000]
[ti:这世代要呼求祢]
[ar:赞美之泉音乐事工]
[00:00.18]这世代要呼求祢 - 赞美之泉音乐事工
[00:01.26]词：陈麒安/游智婷
[00:01.59]曲：陈麒安/游智婷
[00:27.01]主 我属于祢
[00:32.25]求祢差遣 我就跟随
[00:39.36]祢说话
[00:42.41]我就顺服
[00:46.04]勇敢爱祢所爱的
[00:57.05]我们属于祢
[01:02.35]求主开启 我们眼睛
[01:09.45]每世代向祢呼求
[01:16.06]祢教我如何争战
[01:25.98]让我们不分彼此
[01:32.69]众教会同心呼求
[01:42.79]这世代要呼求祢
[01:49.42]呼求祢的爱降临
[01:55.95]高举起代祷双手
[02:02.84]我们心与祢合一
[02:32.67]紧紧跟随 紧紧跟随
[02:39.34]紧紧跟随祢心意
[02:46.07]永不放弃 永不放弃
[02:52.68]直到祢的国降临
[02:59.48]紧紧跟随 紧紧跟随
[03:06.15]紧紧跟随祢心意
[03:12.77]永不放弃 永不放弃
[03:19.40]直到祢的国降临
[03:29.53]这世代要呼求祢
[03:36.00]呼求祢的爱降临
[03:42.74]高举起代祷双手
[03:49.34]我们心与祢合一
[03:56.18]这世代要呼求祢
[04:02.71]呼求祢的爱降临
[04:09.38]破口中勇敢站立
[04:16.07]祢旨意成就这地
[04:46.07]这世代要呼求祢
[04:52.68]呼求祢的爱降临
[04:59.52]高举起代祷双手
[05:06.04]我们心与祢合一
[05:12.83]这世代要呼求祢
[05:19.42]呼求祢的爱降临
[05:26.04]破口中勇敢站立
[05:32.76]祢旨意成就这地
[05:43.01]紧紧跟随 紧紧跟随
[05:49.38]紧紧跟随祢心意
[05:56.17]永不放弃 永不放弃
[06:02.71]直到祢的国降临
[06:09.41]紧紧跟随 紧紧跟随
[06:16.09]紧紧跟随祢心意
[06:22.78]永不放弃 永不放弃
[06:29.43]直到祢的国降临
","url":"https://sharefs.yun.kugou.com/202103041327/21136271808d01ff06e96c0e76ff458b/G071/M03/04/08/J5QEAFdxzR2Acz8oAGoPdkPHmsk926.mp3","pic":"http://singerimg.kugou.com/uploadpic/softhead/150/20150415/20150415095317440163.jpg"}],"code":200,"error":""}
D:/test/爬虫/音乐搜索器/LeoTalk.py:31: DeprecationWarning: invalid escape sequence '\/'
  return responst.content.decode('unicode-escape')

Process finished with exit code 0
